In [1]:
import pandas as pd
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [2]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [3]:
inputs = df.drop('Survived',axis='columns')
target = df.Survived

In [4]:
dummies = pd.get_dummies(inputs.Sex).astype(int)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [5]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [6]:
inputs.drop(['Sex','male'],axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1

In [13]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [14]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [15]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.3)

In [16]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [17]:
model.fit(X_train,y_train)

GaussianNB()

In [18]:
model.score(X_test,y_test)

0.7425373134328358

In [19]:
X_test[0:10]

     Pclass        Age     Fare  female
704       3  26.000000   7.8542       0
410       3  29.699118   7.8958       0
141       3  22.000000   7.7500       1
22        3  15.000000   8.0292       1
588       3  22.000000   8.0500       0
17        2  29.699118  13.0000       0
889       1  26.000000  30.0000       0
592       3  47.000000   7.2500       0
532       3  17.000000   7.2292       0
748       1  19.000000  53.1000       0

In [20]:
model.predict(X_test[0:10])

array([0, 0, 1, 1, 0, 0, 0, 0, 0, 0], dtype=int64)

In [21]:
y_test[0:10]

704    0
410    0
141    1
22     1
588    0
17     1
889    1
592    0
532    0
748    0
Name: Survived, dtype: int64

In [22]:
model.predict_proba(X_test[:10])

array([[0.97158165, 0.02841835],
       [0.97311247, 0.02688753],
       [0.46628333, 0.53371667],
       [0.41599525, 0.58400475],
       [0.9691873 , 0.0308127 ],
       [0.93845812, 0.06154188],
       [0.78119515, 0.21880485],
       [0.97279488, 0.02720512],
       [0.96456999, 0.03543001],
       [0.64749435, 0.35250565]])

In [23]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),X_train, y_train, cv=5)

array([0.76      , 0.832     , 0.816     , 0.81451613, 0.74193548])